# Pandas: Serires e DataFrames

In [ ]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
cidades = [
    'São Paulo (SP)',
    'Rio de Janeiro (RJ)',
    'Brasília (DF)',
    'Fortaleza (CE)',
    'Salvador (BA)',
    'Belo Horizonte (MG)',
    'Manaus (AM)',
    'Curitiba (PR)',
]

populacoes = [
    12,
    6.5,
    3,
    2.4,
    2.4,
    2.3,
    2,
    1.7
]

In [4]:
cidades_serie = pd.Series(cidades)
cidades_serie

0         São Paulo (SP)
1    Rio de Janeiro (RJ)
2          Brasília (DF)
3         Fortaleza (CE)
4          Salvador (BA)
5    Belo Horizonte (MG)
6            Manaus (AM)
7          Curitiba (PR)
dtype: object

In [5]:
populacoes_serie = pd.Series(populacoes)
populacoes_serie

0    12.0
1     6.5
2     3.0
3     2.4
4     2.4
5     2.3
6     2.0
7     1.7
dtype: float64

In [10]:
# acessando itens
cidades_serie[3]

#acessando faixa de itens
cidades_serie[3:5]

3    Fortaleza (CE)
4     Salvador (BA)
dtype: object

In [11]:
# pegando a maior série de populações
populacoes_serie.max()

np.float64(12.0)

In [12]:
# pegando a média de populações
populacoes_serie.mean()

np.float64(4.0375)

In [13]:
# multiplicando
populacoes_serie * 2

0    24.0
1    13.0
2     6.0
3     4.8
4     4.8
5     4.6
6     4.0
7     3.4
dtype: float64

## DataFrames

In [14]:
cidades_populosas = pd.DataFrame({'cidade': cidades_serie, 'populacao em milhoes': populacoes_serie})
cidades_populosas

                cidade  populacao em milhoes
0       São Paulo (SP)                  12.0
1  Rio de Janeiro (RJ)                   6.5
2        Brasília (DF)                   3.0
3       Fortaleza (CE)                   2.4
4        Salvador (BA)                   2.4
5  Belo Horizonte (MG)                   2.3
6          Manaus (AM)                   2.0
7        Curitiba (PR)                   1.7

In [15]:
# informacoes uteis sobre o DataFrame
cidades_populosas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   cidade                8 non-null      object
 1   populacao em milhoes  8 non-null      float64
dtypes: float64(1), object(1)
memory usage: 260.0+ bytes

In [17]:
# pegar uma coluna
cidades_populosas['cidade']

0         São Paulo (SP)
1    Rio de Janeiro (RJ)
2          Brasília (DF)
3         Fortaleza (CE)
4          Salvador (BA)
5    Belo Horizonte (MG)
6            Manaus (AM)
7          Curitiba (PR)
Name: cidade, dtype: object

In [19]:
# pegar uma linha inteira
cidades_populosas.iloc[3]

cidade                  Fortaleza (CE)
populacao em milhoes               2.4
Name: 3, dtype: object

In [20]:
# pegar faixa de indexes
cidades_populosas.iloc[3:5]

           cidade  populacao em milhoes
3  Fortaleza (CE)                   2.4
4   Salvador (BA)                   2.4

In [21]:
# pegar só os 5 primeiros elementos
cidades_populosas.head()

                cidade  populacao em milhoes
0       São Paulo (SP)                  12.0
1  Rio de Janeiro (RJ)                   6.5
2        Brasília (DF)                   3.0
3       Fortaleza (CE)                   2.4
4        Salvador (BA)                   2.4

In [22]:
# pegar só os 5 últimos elementos
cidades_populosas.tail()

                cidade  populacao em milhoes
3       Fortaleza (CE)                   2.4
4        Salvador (BA)                   2.4
5  Belo Horizonte (MG)                   2.3
6          Manaus (AM)                   2.0
7        Curitiba (PR)                   1.7

In [24]:
# média da coluna
cidades_populosas['populacao em milhoes'].mean()

np.float64(4.0375)

## Adicionando Colunas

In [25]:
area_urbana = [
    '914',
    '640',
    '590',
    '253',
    '196',
    '274',
    '277',
    '336'
]

In [26]:
cidades_populosas['area urbana em km2'] = area_urbana
cidades_populosas

                cidade  populacao em milhoes area urbana em km2
0       São Paulo (SP)                  12.0                914
1  Rio de Janeiro (RJ)                   6.5                640
2        Brasília (DF)                   3.0                590
3       Fortaleza (CE)                   2.4                253
4        Salvador (BA)                   2.4                196
5  Belo Horizonte (MG)                   2.3                274
6          Manaus (AM)                   2.0                277
7        Curitiba (PR)                   1.7                336

## Aplicando Funções

In [28]:
cidades_populosas['populacao'] = cidades_populosas['populacao em milhoes'] * 1_000_000
cidades_populosas

                cidade  populacao em milhoes area urbana em km2   populacao
0       São Paulo (SP)                  12.0                914  12000000.0
1  Rio de Janeiro (RJ)                   6.5                640   6500000.0
2        Brasília (DF)                   3.0                590   3000000.0
3       Fortaleza (CE)                   2.4                253   2400000.0
4        Salvador (BA)                   2.4                196   2400000.0
5  Belo Horizonte (MG)                   2.3                274   2300000.0
6          Manaus (AM)                   2.0                277   2000000.0
7        Curitiba (PR)                   1.7                336   1700000.0

In [29]:
cidades_populosas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   cidade                8 non-null      object
 1   populacao em milhoes  8 non-null      float64
 2   area urbana em km2    8 non-null      object
 3   populacao             8 non-null      float64
dtypes: float64(2), object(2)
memory usage: 388.0+ bytes

In [31]:
cidades_populosas['area urbana em km2'] = cidades_populosas['area urbana em km2'].astype(int)
cidades_populosas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   cidade                8 non-null      object
 1   populacao em milhoes  8 non-null      float64
 2   area urbana em km2    8 non-null      int64
 3   populacao             8 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 388.0+ bytes

## Combinando Dados de Colunas

In [32]:
cidades_populosas['habitantes por km2'] = cidades_populosas['populacao'] / cidades_populosas['area urbana em km2']
cidades_populosas

,cidade,populacao em milhoes,area urbana em km2,populacao,habitantes por km2
0,São Paulo (SP),12.0,914,12000000.0,13129.102845
1,Rio de Janeiro (RJ),6.5,640,6500000.0,10156.250000
2,Brasília (DF),3.0,590,3000000.0,5084.745763
3,Fortaleza (CE),2.4,253,2400000.0,9486.166008
4,Salvador (BA),2.4,196,2400000.0,12244.897959
5,Belo Horizonte (MG),2.3,274,2300000.0,8394.160584
6,Manaus (AM),2.0,277,2000000.0,7220.216606
7,Curitiba (PR),1.7,336,1700000.0,5059.523810

In [36]:
def teste_de_nome(nome, dict_de_nomes):
    if nome in dict_de_nomes:
        return True
    return False

dict_de_nomes = {
    'Bruna':1,
    'Pedro':1,
    'Fabricio':1,
    'Carla':1,
    'Carolina':1,
    'Felipe':1
}

nome = 'Debora'

if(teste_de_nome(nome, dict_de_nomes)):
    dict_de_nomes[nome] += 1
else:
    dict_de_nomes[nome] = 1

print('Lista final', dict_de_nomes)

Lista final {'Bruna': 1, 'Pedro': 1, 'Fabricio': 1, 'Carla': 1, 'Carolina': 1, 'Felipe': 1, 'Debora': 1}

In [38]:
## exercicios